So, when applying this, it goes cleanly and has no issues. When upgrading a bucket from the prior version of the module, you still get the drift because the defaults are changing, even though it's not materially different :-( 

Given that you still get the drift, I wonder if there is any point in making this update at all? Because you could argue then that the original code wasn't technically broken 🤷 

Here's what the drift looks like, which is identical to the drift that was there from before I updated the module:

<details>

```terraform

  # module.settings_bucket.aws_s3_bucket_lifecycle_configuration.private_bucket will be updated in-place
  ~ resource "aws_s3_bucket_lifecycle_configuration" "private_bucket" {
        id                                     = "eclkc-stage-bootstrap-files"
      ~ transition_default_minimum_object_size = "varies_by_storage_class" -> "all_storage_classes_128K"
        # (2 unchanged attributes hidden)

      ~ rule {
            id     = "abort-incomplete-multipart-upload"
            # (2 unchanged attributes hidden)

          - filter {
                # (1 unchanged attribute hidden)
            }

          ~ noncurrent_version_expiration {
              + newer_noncurrent_versions = (known after apply)
                # (1 unchanged attribute hidden)
            }

          - noncurrent_version_transition {
              - noncurrent_days = 30 -> null
              - storage_class   = "STANDARD_IA" -> null
            }
          + noncurrent_version_transition {
              + newer_noncurrent_versions = (known after apply)
              + noncurrent_days           = 30
              + storage_class             = "STANDARD_IA"
            }

            # (2 unchanged blocks hidden)
        }
      ~ rule {
            id     = "aws-bucket-inventory"
          ~ status = "Enabled" -> "Disabled"
            # (1 unchanged attribute hidden)

          ~ expiration {
              ~ expired_object_delete_marker = false -> (known after apply)
                # (1 unchanged attribute hidden)
            }

          ~ filter {
              + object_size_greater_than = (known after apply)
              + object_size_less_than    = (known after apply)
                # (1 unchanged attribute hidden)
            }
        }
      ~ rule {
            id     = "aws-bucket-analytics"
            # (2 unchanged attributes hidden)

          ~ expiration {
              ~ expired_object_delete_marker = false -> (known after apply)
                # (1 unchanged attribute hidden)
            }

          ~ filter {
              + object_size_greater_than = (known after apply)
              + object_size_less_than    = (known after apply)
                # (1 unchanged attribute hidden)
            }
        }
    }

```
</details>

I think my changes help make it a bit clearer what the module is doing, but...I don't know if this is worth a major version upgrade now that it doesn't materially change anything.  :-( 
